# -*- coding: utf-8 -*-
'''
5年期国债期货合约表
合约标的	面值为100万元人民币、票面利率为3%的名义中期国债
可交割国债	合约到期月份首日剩余期限为4-5.25年的记账式附息国债
报价方式	百元净价报价
最小变动价位	0.005元
合约月份	最近的三个季月（3月、6月、9月、12月中的最近三个月循环）
交易时间	09:15—11:30， 13:00—15:15
最后交易日交易时间	09:15—11:30
每日价格最大波动限制	上一交易日结算价的±1.2%
最低交易保证金	合约价值的1%
最后交易日	合约到期月份的第二个星期五
最后交割日	最后交易日后的第三个交易日
交割方式	实物交割
交易代码	TF
上市交易所	中国金融期货交易所


10年期国债期货合约表
合约标的	面值为100万元人民币、票面利率为3%的名义长期国债
可交割国债	合约到期月份首日剩余期限为6.5-10.25年的记账式附息国债
报价方式	百元净价报价
最小变动价位	0.005元
合约月份	最近的三个季月（3月、6月、9月、12月中的最近三个月循环）
交易时间	9:15 - 11:30，13:00 - 15:15
最后交易日交易时间	9:15 - 11:30
每日价格最大波动限制	上一交易日结算价的±2%
最低交易保证金	合约价值的2%
最后交易日	合约到期月份的第二个星期五
最后交割日	最后交易日后的第三个交易日
交割方式	实物交割
交易代码	T
上市交易所	中国金融期货交易所
'''
