# -*- coding: utf-8 -*-
'''
沪深300指数
    是由上海和深圳证券市场中选取300只A股作为样本编制而成的成份股指数。
    沪深300指数样本覆盖了沪深市场六成左右的市值，具有良好的市场代表性。
沪深300指数期货合约表
合约标的	沪深300指数
合约乘数	每点300元
报价单位	指数点
最小变动价位	0.2点
合约月份	当月、下月及随后两个季月
交易时间	上午：9:30-11:30，下午：13:00-15:00
每日价格最大波动限制	上一个交易日结算价的±10%
最低交易保证金	合约价值的8%
最后交易日	合约到期月份的第三个周五，遇国家法定假日顺延
交割日期	同最后交易日
交割方式	现金交割
交易代码	IF
上市交易所	中国金融期货交易所

上证50指数
    是根据科学客观的方法，挑选上海证券市场规模大、流动性好的最具代表性的50只股票组成样本股，
    以便综合反映上海证券市场最具市场影响力的一批龙头企业的整体状况。
上证50股指期货合约表
合约标的	上证50指数
合约乘数	每点300元
报价单位	指数点
最小变动价位	0.2点
合约月份	当月、下月及随后两个季月
交易时间	上午： 9:30-11:30，下午：13:00-15:00
每日价格最大波动限制	上一个交易日结算价的±10% 
最低交易保证金	合约价值的8%
最后交易日	合约到期月份的第三个周五，遇国家法定假日顺延
交割日期	同最后交易日
交割方式	现金交割
交易代码	IH
上市交易所	中国金融期货交易所

中证500指数
    是根据科学客观的方法，挑选沪深证券市场内具有代表性的中小市值公司组成样本股，以便综合反映沪深证券市场内中小市值公司的整体状况。
    其样本空间内股票扣除沪深300指数样本股及最近一年日均总市值排名前300名的股票，
    剩余股票按照最近一年（新股为上市以来）的日均成交金额由高到低排名，剔除排名后20%的股票，
    然后将剩余股票按照日均总市值由高到低进行排名，选取排名在前500名的股票作为中证500指数样本股。
中证500股指期货合约表
合约标的	中证500指数
合约乘数	每点200元
报价单位	指数点
最小变动价位	0.2点
合约月份	当月、下月及随后两个季月
交易时间	上午： 9:30-11:30, 下午：13:00-15:00 
每日价格最大波动限制	上一个交易日结算价的±10%
最低交易保证金	合约价值的8%
最后交易日	合约到期月份的第三个周五，遇国家法定假日顺延
交割日期	同最后交易日
交割方式	现金交割
交易代码	IC
上市交易所	中国金融期货交易所
'''
