# -*- coding: utf-8 -*-
'''
基金(共同基金)
    1.开放式基金(占比90%)
        1.1.根据能不能在证券交易所挂牌交易
            1.1.1.上市交易型开放式基金
                 1.1.1.1.ETF(交易型开放式指数基金)
                 1.1.1.2.LOF(上市开放式基金)
            1.1.2契约型开放式基金
                不能上市交易
                只在基金公司和投资者之间进行申购和赎回操作
        1.2.根据投资对象的不同
            1.2.1.股票基金(股票投资比重占比60%以上)
            1.2.2.债券基金(债券投资比重占比80%以上)
            1.2.3.混合基金(股票基金和债券基金之间，比例灵活可控的)
            1.2.4.货币市场基金
                  是指以国库券、大额银行可转让存单、商业票据、公司债券等货币市场短期有价证券为投资对象的投资基金
            1.2.5.期货基金
                  各类期货品种为主要投资对象的投资基金
            1.2.6.期权基金
            1.2.7.认股权证基金
        1.3.根据不同的投资风格
            1.3.1.成长型股票基金
                是指主要投资于收益增长速度快，未来发展潜力大的成长型股票的基金
            1.3.2.价值型股票基金
                是指主要投资于价值被低估、安全性较高的股票的基金
                价值型股票基金风险要低于成长型股票基金
            1.3.3.混合型股票基金
                是介于以上两者之间。
        1.4.根据投资目标的不同
            1.4.1.成长型基金
                是指以追求资产的长期增值和盈利为基本目标从而投资于具有良好增长潜力的上市股票或其他证券的证券投资基金。
            1.4.2.收入型基金
                是指以追求当期高收入为基本目标从而以能带来稳定收入的证券为主要投资对象的证券投资基金。
            1.4.3.平衡型基金
                是指以保障资本安全、当期收益分配、资本和收益的长期成长等为基本目标
                在投资组合中比较注重长短期收益－风险搭配的证券投资基金。
        1.5.根据投资理念的不同
            1.5.1.主动型基金
                力图取得超越基准组合表现的基金。
            1.5.2.被动（指数型）基金
                与主动型不同，被动性基金并不主动寻求取得超越市场的表现，而是试图复制指数的表现。
                被动型基金一般选取特定的指数作为跟踪对象，因此通常又被称为指数基金。    2.封闭式基金




'''